src/Documents/ПриёмНаРаботу/ПриёмНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриёмНаРаботу</name>
  <basedOn>Catalog.ФизическиеЛица</basedOn>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрудоваяДеятельность</name>
    <attributes>
      <name>НачалоРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПриёмНаРаботу/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		// Заполнение шапки
		Сотрудник = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТрудоваяДеятельность Из ДанныеЗаполнения.ТрудоваяДеятельность Цикл
			НоваяСтрока = ТрудоваяДеятельность.Добавить();
			НоваяСтрока.Должность = ТекСтрокаТрудоваяДеятельность.Должность;
			НоваяСтрока.НачалоРаботы = ТекСтрокаТрудоваяДеятельность.НачалоРаботы;
			НоваяСтрока.ОкончаниеРаботы = ТекСтрокаТрудоваяДеятельность.ОкончаниеРаботы;
			НоваяСтрока.Организация = ТекСтрокаТрудоваяДеятельность.Организация;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
